spec/dummy/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    puts 'testing'
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "abc"], ["created_at", Sat, 25 Aug 2012 05:06:15 UTC +00:00], ["title", "123"], ["updated_at", Sat, 25 Aug 2012 05:06:15 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save